Repository: pylorak/TinyWall
Catalog: TinyWall/Resources/Messages.*.resx
Languages: ko, ru

# CouldNotElevatePrivilegesForUpdate
source: Could not elevate privileges necessary for update.
ko: ������Ʈ�� �ʿ��� ������ ȹ���� �� �����ϴ�.
ru: Недостаточно прав для выполнения обновления.

source: TinyWall Updater
ko: TinyWall ������Ʈ
ru: Обновление TinyWall

# ErrorCheckingForUpdates
source: Cannot access the update server. The server might be down, or please make sure that TinyWall has been granted internet access, then try again.
ko: ������Ʈ ������ ������ �� �����ϴ�. ������ �ٿ� ������ �� �ֽ��ϴ�. �Ǵ� TinyWall�� ���ͳݿ� ������ �� �ִ��� Ȯ���ϰ� �ٽ� �õ����ּ���.
ru: Не могу соединиться с сервером обновлений. Сервер может быть недоступен. Пожалйста убедитесь, что TinyWall имеет доступ к интернету, а потом попробуйте обновиться снова.

# UpdateAvailable
source: A newer version {0} of TinyWall is available. Do you want to update now?
ko: TinyWall�� ���ο� ���� {0} ��� ����! ���� ������Ʈ�Ͻðڽ��ϱ�?
ru: Новая версия {0} TinyWall доступна для загрузки и установки. Вы хотите обновить программу прямо сейчас?

source: Downloading update...
ko: ������Ʈ �����޴� ��...
ru: Загрузка обновлений...

# NoUpdateAvailable
source: You have the newest version of TinyWall. No update necessary.
ko: TinyWall�� �ֽ� ������ ��� ���Դϴ�. ������Ʈ�� �ʿ����� �ʽ��ϴ�.
ru: У вас самая новая версия TinyWall. Обновление не нужно.

source: Download interrupted.
ko: �ٿ�ε尡 �ߴܵǾ����ϴ�.
ru: Загрузка прервана.

source: Starting update...
ko: ������Ʈ ���� ��...
ru: Начинаем обновление...

# TinyWallIsCurrentlyLocked
source: TinyWall is current locked. Unlock and retry.
ko: TinyWall�� ���� ��� �ֽ��ϴ�. ����� �����ϰ� �ٽ� �õ��ϼ���.
ru: TinyWall заблокирована. Разблокируйте программу и повторите попытку.

# PleaseWaitWhileTinyWallChecksForUpdates
source: Please wait while TinyWall checks for available updates.
ko: TinyWall�� ������Ʈ�� Ȯ���ϴ� ���� ��� ��ٷ� �ּ���.
ru: Пожалуйста подождите, пока TinyWall проверит доступность обновлений.

# CouldNotWhitelistProcess
source: Could not whitelist process of {0}.
ko: {0}�� ���μ����� ����� �� �����ϴ�.
ru: Процесс {0} не удалось добавить в белый список.

# CouldNotCloseProcess
source: Could not close process {0}({1}).
ko: {0}({1}) ���μ����� ������ �� �����ϴ�.
ru: Не могу закрыть процесс {0}({1}).

# PasswordFieldsDoNotMatch
source: Password fields do not match. Please verify your input.
ko: ��й�ȣ �Է¶��� ��ġ���� �ʽ��ϴ�. ��й�ȣ�� Ȯ�����ּ���.
ru: Введён неверный пароль. Пожалуйста убедитесь в корректности ввода.

# AreYouSureYouWantToRemoveAllExceptions
source: Are you sure you want to remove all firewall exceptions?
ko: ������ ��� ��ȭ�� ���ܸ� �����Ͻðڽ��ϱ�?
ru: Вы точно хотите удалить все исключения фаервола?

# YouDoNotHaveAdministrativePrivilegesNeeded
source: You do not have administrative privileges needed to perform this operation. Select Elevate from the tray menu and try again.
ko: �� �۾��� �����ϴµ� �ʿ��� ���� ������ �����ϴ�. Ʈ���� �޴����� ���� ����� �����ϰ� �ٽ� �õ��ϼ���.
ru: У вас нет прав администратора для выполнения этой операции. Выберите повышение прав в меню трея и попробуйте снова.

# TinyWallSettingsFileFilter
source: TinyWall Settings
ko: TinyWall ����
ru: Настройки TinyWall

# AllFilesFileFilter
source: All files
ru: Все файлы

# ConfigurationHasBeenImported
source: The configuration file has been successfully imported. Press Apply in the Manage window to make the new settings permanent.
ko: ���� ������ ���������� �����Խ��ϴ�. ���ο� ������ �����Ϸ��� ���� â���� ������ ��������.
ru: Файл настроек успешно импортирован. Нажмите кнопку Применить в окне Настроек, чтоб сделать новые настройки текущими.

# ConfigurationHasBeenExported
source: The configuration file has been successfully exported.
ko: ���� ������ ���������� �����½��ϴ�.
ru: Файл настроек успешно экспортирован.

source: Mode
ru: Режим

source: Unlock
ru: Разблокировать

source: Lock
ru: Блокировать

# UpdateAvailableBubble
source: A newer version {0} of TinyWall is available. Click this bubble to start the update process.
ko: TinyWall�� ���ο� ���� {0} ��� ����! ������Ʈ �۾��� �����Ϸ��� �� ������ ��������.
ru: Новая версия {0} TinyWall доступна. Нажмите на сюда для запуска процесса обновления.

# TheFirewallIsNowOperatingAsRecommended
source: The firewall is now operating in the recommended mode.
ko: ��ȭ���� ���� ���� ���� �۵� ���Դϴ�.
ru: Фаервол работает в рекомендуемом режиме.

# TheFirewallIsNowAllowsOutgoingConnections
source: The firewall is now allowing outgoing connections but blocks incoming.
ko: ��ȭ���� ���� ������ ������ ��������� ������ ������ ���� ���Դϴ�.
ru: Фаервол сейчас блокирует входящие и пропускает исходящие соединения.

# TheFirewallIsNowBlockingAllInAndOut
source: The firewall is now blocking all inbound and outbound traffic.
ko: ��ȭ���� ���� ��� �ιٿ��� �ƿ�ٿ�� Ʈ������ ���� ���Դϴ�.
ru: Фаервол сейчас блокирует весь входящий и исходящий трафик.

source: The firewall is now disabled.
ko: ��ȭ���� ���� ��Ȱ��ȭ�Ǿ����ϴ�.
ru: Фаервол выключен.

# TheTinyWallServiceIsUnavailable
source: The TinyWall service is unavailable. Please make sure it is installed and started, then retry.
ko: TinyWall ���� ��� �Ұ�! ���񽺰� ��ġ�Ǿ��� ���۵Ǿ����� Ȯ���� ���� �ٽ� �õ����ּ���.
ru: Служба TinyWall недоступна. Убедитесь, что она установлена и запущена, и повторите попытку.

# TrafficIn
source: In
ru: Входящий

# TrafficOut
source: Out
ru: Исходящий

# TheFirewallSettingsHaveBeenUpdated
source: The firewall settings have been successfully updated.
ko: ��ȭ�� ������ ���������� ������Ʈ�Ǿ����ϴ�.
ru: Настройки фаервола были успешно обновлены.

source: Success.
ru: Успех.

# OtherSettingsPreventEffect
source: The operation succeeded, but other settings prevent it from taking full effect.
ko: �۾��� ���������� �ٸ� �������� ���� ������ ȿ���� ������� �ʽ��ϴ�.
ru: Операция выполнена успешно, но другие настройки повлияли на её выполнение.

source: Operation failed.
ko: �۾� ���е�.
ru: Операция не выполнена.

# CommunicationWithTheServiceError
source: Communication with the TinyWall service encountered an error.
ko: TinyWall ���񽺿��� ��� �� ������ �߻��߽��ϴ�.
ru: При взаимодействии со службой TinyWall произошла ошибка.

# ClickOnAWindowWhitelisting
source: Click on the inner area of any open window to select its application for whitelisting.
ko: ����� ���� ���α׷��� �����Ϸ��� ���� â�� ���� ������ �����ϴ�.
ru: Щелкните мышкой по содержимому любого окна, для его добавления в белый список

source: Whitelisting cancelled.
ko: ����� ��ҵǾ����ϴ�.
ru: Отмена добавления в белый список.

# CannotGetExecutablePathWhitelisting
source: Cannot get executable path. Whitelisting failed.
ko: ���� ������ ��θ� Ȯ���� �� ���� ����� ���еǾ����ϴ�.
ru: Не могу получить путь исполняемого файла. Ошибка добавления в белый список.

# FirewallRulesForRecognizedChanged
source: Firewall rules for recognized {0} have been changed. Click this popup to edit the exception.
ko: �νĵ� {0}�� ��ȭ�� ��Ģ�� ����Ǿ����ϴ�. ���ܸ� �����Ϸ��� �� �˾��� ��������.
ru: Правило фаервола для известной программы {0} изменилось. Щелкните по этому сообщению для редактирования исключения.

# FirewallRulesForUnrecognizedChanged
source: Firewall rules for unrecognized {0} have been changed. Click this popup to edit the exception.
ko: �νĵ��� ���� {0}�� ��ȭ�� ��Ģ�� ����Ǿ����ϴ�. ���ܸ� �����Ϸ��� �� �˾��� ��������.
ru: Правило фаервола для неизвестной программы {0} изменилось. Щелкните по этому сообщению для редактирования исключения.

# TinyWallHasBeenUnlocked
source: TinyWall has been unlocked. You may now issue commands that modify the configuration.
ko: TinyWall�� ��� �����Ǿ����ϴ�. ���� ������ �����ϴ� ����� issue�� �� �ֽ��ϴ�.
ru: Программа TinyWall разблокирована. Теперь вы можете выполнят команды, изменяющие ее настройки.

# UnlockFailed
source: Unlock failed. Try again with another passphrase.
ko: ��� ���� ���е�. �ٸ� ��ȣ�� �ٽ� �õ��ϼ���.
ru: Разблокировка неудачна. Попробуйте снова с другим паролем.

source: Could not elevate privileges.
ko: ������ ����� �� �����ϴ�.
ru: Не могу повысить привилегии.

source: Database is missing or corrupt.
ko: �����ͺ��̽��� ����Ǿ��ų� �ջ�Ǿ����ϴ�.
ru: База данных отсутствует или повреждена.

source: Stop
ru: Остановить

source: Start
ru: Запустить

# SearchingPath
source: Searching: {0}
ru: Поиск: {0}

source: Search results:
ru: Результаты поиска:

# RecognizedApplication
source: Recognized {0}
ko: {0} �νĵ�
ru: Распознано {0}

source: Unknown application
ko: �� �� ���� ���� ���α׷�
ru: Неизвестные приложения

source: Permanent
ru: Постоянный

source: Until reboot
ru: До перезагрузки

# XMinutes
source: {0} minutes
ru: {0} минут

# XHour
source: {0} hour
ko: {0} �ð�
ru: {0} час

# XHours
source: {0} hours
ko: {0} �ð�
ru: {0} часов

# FirewallModeAllowOut
source: Allow outgoing
ru: Разрешены исходящие

# FirewallModeBlockAll
source: Block all
ru: Влокировать всё

# FirewallModeDisabled
source: Disabled
ko: ��Ȱ��ȭ��
ru: Отключен

# FirewallModeNormal
source: Normal
ru: Обычный

# FirewallModeUnknown
source: Unknown
ru: Неизвестный

source: Cannot get path of process.
ko: ���μ����� ��θ� Ȯ���� �� �����ϴ�.
ru: Не могу получить путь процесса.

# TheFirewallIsNowLearning
source: The firewall is now learning while letting all traffic through.
ko: ��ȭ���� ���� ��� Ʈ������ �����Ű�鼭 �н��ϰ� �ֽ��ϴ�.
ru: Фаервол в режиме обучения. Трафик не ограничивается.

# FirewallModeLearn
source: Autolearn
ko: �ڵ� �н�
ru: Автообучение.

# YouAreAboutToEnterLearningMode
source: Are you sure you want to start automatic learning? In its automatic learning mode TinyWall will allow all traffic and remember which applications have used the network. When you exit learning mode, TinyWall will add exceptions for you automatically. Note however, that rules cannot be learned for "Special Exceptions" of the configuration. Before entering learning mode, make sure that your system is free of any malware. It is best to run learning mode on freshly installed systems and it is recommended that you check your computer for viruses before using this mode. Do you want to enter learning mode now?
ko: �ڵ� �н��� �����Ͻðڽ��ϱ�? �ڵ� �н� ��忡�� TinyWall�� ��� Ʈ������ ����ϰ� ��Ʈ��ũ�� ����� ���� ���α׷��� ����մϴ�. �н� ��带 �����ϸ� TinyWall�� �ڵ����� ���ܸ� �߰��մϴ�. �׷��� ������ "Ư�� ����"�� ���ؼ��� ��Ģ�� �н� �� �� ������ �˾Ƶμ���. �н� ���� �����ϱ� ���� �ý��ۿ� �ֿ�� ������ Ȯ�����ּ���. ���� ��ġ�� �ý��ۿ��� �н� ��带 �����ϴ� ���� ���� ������ �� ��带 ����ϱ� ���� ��ǻ�Ϳ��� ���̷����� �˻��Ͽ� ������ ���¿��� �н� ��带 ����ϴ� ���� �����ϴ�. ���� �н� ���� �����Ͻðڽ��ϱ�?
ru: Вы уверены, что хотите включить режим автообучения? В этом режиме TinyWall пропускает любой трафик и запоминает приложения, использующие сеть. Когда вы выйдете из режима обучения, TinyWall добавит исключения автоматически. Обратите внимание на то, что правила для "Специальных исключений", в процессе обучения не создаются. Перед входом в режим обучения убедитесь, что в вашей системе нет вредоносных прграмм. Самый хороший вариант - запуск режима обучения на только что установленной операционной системе. Также рекомендуется проверить компьютер на вирусы. Вы уверены, что хотите запустить режим обучения прямо сейчас?

# DidYouInitiateTheUninstall
source: Did you initiate the uninstall/update of TinyWall?
ko: TinyWall�� ����/������Ʈ�� �����߳���?
ru: Удалить TinyWall?

# PortListInvalid
source: The format of the port list is invalid. You can use one or more numbers in the range of 1-65535, separated by commas. An asterix (*) can also be used to refer to all possible ports.
ko: ��Ʈ ����� ������ ��ȿ���� �ʽ��ϴ�. 1-65535 �������� �ϳ� �̻��� ���ڸ� ����� �� �ֽ��ϴ�. (��ǥ�� ����). ��ǥ(*)�� ����� ������ ��� ��Ʈ�� ��Ÿ�� ���� �ֽ��ϴ�.
ru: Неправильный формат списка портов. Вы можете использовать одно или несколько чисел в диапозоне 1-65535, отделяя их запятыми. Можно использовать звездочку (*) для задания всевозможных портов.

# UnblockAppCancel
source: Cancel whitelisting
ru: Отмена добавления в белый список

# UnblockApp
source: Related files found The selected executable could be part of {0}. To ensure that this application can be used without limitations, it is recommended to also unblock some other files.
ko: ���õ� ���� �߰ߵ�. ������ ���� ������ {0}�� �Ϻ��� �� �ֽ��ϴ�. �� ���� ���α׷��� ���Ѿ��� ����Ϸ���, �ٸ� ���ϵ鵵 ���� �����Ͻñ� �����մϴ�.
ru: Обнаружены файлы, связанные с исполняемым, который является частью {0}. Для уверенности, что это приложение может использоваться без ограничений, рекоменуется разблокировать некоторые другие файлы.

# UnblockAppShowRelated
source: Show/hide related executables
ko: ���õ� ���� ���� ǥ��/����
ru: Показать/Спрятать файлы связанные с исполняемым файлы

# UnblockAppUnblockAllRecommended
source: Unblock all recommended files
ru: Разблокировать все рекомендуемые файлы

# UnblockAppUnblockOnlySelected
source: Unblock only selected file
ko: ������ ���ϸ� ���� ����
ru: Разблокировать только выделенные файлы

# ConfigurationImportError
source: Could not import configuration file.
ko: ���� ������ ������ �� �����ϴ�.

# SettingHaveChangedRetry
source: The configuration has changed while you modified the preferences. To prevent losing settings, please make your changes again.
ko: ȯ�� ������ �����ϴ� ���� ������ ����Ǿ����ϴ�. ������ �սǵ��� �ʵ��� �ٽ� �������ּ���.

# CouldNotApplySettingsInternalError
source: Could not apply firewall settings due to an internal error.
ko: ���� ������ ���� ��ȭ�� ������ ������ �� �����ϴ�.
