Repository: pylorak/TinyWall
Catalog: TinyWall/ApplicationExceptionForm.*.resx
Languages: he_il, pl, pt_br, ru

# btnCancel.Text
source: Cancel
he_il: ביטול
pl: Anuluj
pt_br: Cancelar
ru: Отмена

# btnOK.Text
source: OK
he_il: אישור
ru: ОК

# btnBrowse.Text
source: Browse for a file...
he_il: עיון עבור קובץ...
pl: Przeglądaj pliki…
pt_br: Procurar arquivo...
ru: Выбрать файл...

# btnProcess.Text
source: Select a process...
he_il: בחירה ביישום שרץ כרגע...
pl: Wybierz proces…
pt_br: Selecionar executável...
ru: Выбрать процесс...

# btnChooseService.Text
source: Choose a service...
he_il: בחירה ביישום מסוג שירות-רקע
pl: Wybierz usługę…
pt_br: Selecionar serviço...
ru: Выбрать службу...

# ofd.Title
source: Select application executable
he_il: בחירה בקובץ הרצה של יישום
pl: Wybierz plik wykonywalny aplikacji .exe
pt_br: Escolha o executável
ru: Выбор исполняемого файла приложения

# label6.Text
source: Exception lifetime:
he_il: מגבלת-זמן לחריגה:
pl: Wygasa po:
pt_br: Controlar:
ru: Время действия исключения

# transparentLabel1.Text
source: Recognised placeholder
he_il: שומר-מקום ידוע
pl: Rozpoznany element zastępczy
pt_br: Demarcador de reconhecidos

# btnSelectUwpApp.Text
source: Pick a UWP app...
he_il: בחר יישום-חלונות-אוניברסלי UWP...
pl: Wybierz aplikację UWP...

# chkRestrictToLocalNetwork.Text
source: Restrict to local network
he_il: הגבלה לרשת-מקומית
pl: Reguła aktywna w sieci lokalnej
pt_br: Restringir o tráfego à rede local
ru: Ограничить локальную сеть

# radBlock.Text
source: Always block all traffic
he_il: תמיד חסום את כל תעבורת-הרשת
pl: Reguła: blokuj cały ruch sieciowy
pt_br: Sempre bloquear qualquer tipo de tráfego
ru: Блокировать весь трафик

# radTcpUdpOut.Text
source: Allow outgoing UDP and TCP traffic
he_il: להרשות תעבורת-רשת מסוג UDP ו- TCP
pl: Reguła: zezwól na wychodzący ruch sieciowy UDP i TCP
pt_br: Permitir tráfego de saída por UDP e TCP
ru: Разрешить исходящий UDP и TCP трафик

# radTcpUdpUnrestricted.Text
source: Unrestricted UDP and TCP traffic
he_il: תעבורת-רשת מסוג UDP ו- TCP לא מוגבלת
pl: Reguła: nieograniczony ruch UDP i TCP
pt_br: Permitir tráfego por UDP e TCP irrestrito (entrada e saída)
ru: Неограниченный UDP и TCP трафик

# radUnrestricted.Text
source: No restrictions
he_il: ללא הגבלות
pl: Reguła: brak ograniczeń
pt_br: Não impor nenhuma restrição
ru: Без ограничений

# label5.Text
source: Open up the following ports, in addition to the restrictions above. (Comma-separated list)
he_il: פתיחה של הפורטים הבאים, בנוסף למגבלות שהוזנו למעלה. (רשימת-פורטים מופרדת בפסיק)
pl: Otwórz następujące porty dla tego połączenia (listę portów oddziel przecinkami)
pt_br: Abrir as seguintes portas, além de impor a restrição indicada acima. (Separar por vírgula)
ru: Открыть следующие порты, в добавок к вышеуказанным исключениям (список портов через запятую)

# txtListenPortUDP.AccessibleName
source: Incoming UDP
he_il: תעבורת-רשת נכנסת מסוג UDP
pl: Przychodzące UDP
pt_br: UDP de Entrada
ru: Входящий UDP

# txtListenPortTCP.AccessibleName
source: Incoming TCP
he_il: תעבורת-רשת נכנסת מסוג TCP
pl: Przychodzące TCP
pt_br: TCP de entrada
ru: Входящий TCP

# txtOutboundPortUDP.AccessibleName
source: Outgoing UDP
he_il: תעבורת-רשת יוצאת מסוג UDP
pl: Wychodzące UDP
pt_br: UDP de Saída
ru: Исходящий UDP

# txtOutboundPortTCP.AccessibleName
source: Outgoing TCP
he_il: תעבורת-רשת יוצאת מסוג TCP
pl: Wychodzące TCP
pt_br: TCP de Saída
ru: Исходящий TCP

# radOnlySpecifiedPorts.Text
source: Allow only specified ports
he_il: מתן-רשות רק לפורטים מסויימים
pl: Reguła: zezwól dla określonych portów
pt_br: Só permitir pelas portas especificadas abaixo
ru: Разрешить только указанные порты

# chkInheritToChildren.Text
source: Apply same rules to child processes
he_il: הפעלת אותם הכללים לכל יישום שנוצר על ידי היישום הזה
pl: Zastosuj te same zasady do procesów podrzędnych

# $this.Text
source: Add/Modify Firewall Exception - TinyWall
he_il: הוספה/שינוי של חריגי חומת-אש - TinyWall
pl: Dodaj/modyfikuj regułę zapory - TinyWall
pt_br: Adição/Modificação de Aplicativo Controlado - Exceções - TinyWall
ru: Добавить/Изменить исключения фаервола TinyWall
