Repository: pylorak/TinyWall
Catalog: TinyWall/SettingsForm.*.resx
Languages: bg

# btnCancel.Text
source: Cancel
bg: Отмени

# btnOK.Text
source: Apply
bg: Приложи

# txtExceptionListFilter.AccessibleName
source: Filter
bg: Филтър

# btnAppRemoveAll.Text
source: Remove all
bg: Премахни всички

# btnAppAutoDetect.Text
source: Detect
bg: Засечи

# btnSubmitAssoc.Text
source: Submit
bg: Приеми

# label3.Text
source: Edit the list of applications that you'd like to grant network access. Only applications in this list will be able to communicate. Use the Detect button to let TinyWall detect some software, or add applications manually.
bg: Редактирайте списъка с приложения, които разрешавате достъп до мрежата. Само приложения в списъка ще могат да комуникират. Използвайте бутоона "Засечи" за да позволите на TinyWall да засече даден софтуер или да добавете приложения ръчно.

# btnAppRemove.Text
source: Remove
bg: Премахни

# btnAppModify.Text
source: Modify
bg: Промени

# btnAppAdd.Text
source: Add application
bg: Добави приложение

# label4.Text
source: Filter:
bg: Филтър

# tabPage3.Text
source: Application Exceptions
bg: Приложения - изключения

# label5.Text
source: Select special tasks or applications that you'd like to enable on this machine. Note that disabling recommended exceptions can seriously limit the usability and security of your system.
bg: Изберете конкретни приложения или задачи, които искате да позволите на тази машина. Забележка: спирането на препоръчаните изключения могат да застрашат сигурността на системата ви.

# label2.Text
source: Optional
bg: По избор

# label1.Text
source: Recommended
bg: Препоръчано

# tabPage2.Text
source: Special Exceptions
bg: Спциални изкючения

# chkEnableHotkeys.Text
source: Enable global hotkeys
bg: Включи глобални клавишни съкращения

# label11.Text
source: Language:
bg: Език

# chkEnableBlocklists.Text
source: Enable blocklists
bg: Пусни блокиращи списъци

# chkLockHostsFile.Text
source: Prevent modifications to hosts file
bg: Забрани редакция на хост файла

# chkHostsBlocklist.Text
source: Domain-based malware and ad blocklist
bg: Вирурси, базирани на домейна и blocklist

# chkAutoUpdateCheck.Text
source: Automatically check for updates
bg: Автоматично проверявай за ъпдейти

# chkBlockMalwarePorts.Text
source: Port-based malware blocklist
bg: Черен списък по портове за malware

# label9.Text
source: To remove an enabled password protection, check "Change password" and leave the text fields empty.
bg: За да премахнете паролата, изберете "Промени парола" и оставете полето празно.

# label8.Text
source: Retype:
bg: Повторете:

# label7.Text
source: Password:
bg: Парола:

# chkChangePassword.Text
source: Change password
bg: Промени парола

# groupBox1.Text
source: Password protection
bg: Защита на парола

# chkAskForExceptionDetails.Text
source: Prompt for exception details
bg: Информация за допълнителни изключения

# tabPage1.Text
source: General
bg: Главно

# btnImport.Text
source: Import Settings
bg: Импорт настройки

# btnExport.Text
source: Export Settings
bg: Експорт настройки

# lblLinkAttributions.Text
source: Attributions
bg: Разработчик

# btnDonate.AccessibleDescription
source: Donate
bg: Дарение

# btnDonate.AccessibleName
source: Donation
bg: Дарение

# lblLinkLicense.Text
source: Licence
bg: Лиценз

# label10.Text
source: If you like and use this free program, please consider donating to cover hosting, hardware and software costs.
bg: Ако приложението Ви харесва, моля направете дарение за неговата поддръжка.

# groupBox2.Text
source: About
bg: За приложението

# btnUpdate.Text
source: Update
bg: Обнови

# btnWeb.Text
source: Visit webpage
bg: Посети уеб сайт

# tabPage4.Text
source: Maintenance
bg: Обслужване

# $this.Text
source: TinyWall Firewall Settings
bg: Настройки - TinyWall
